<?php
//错误码格式：共六位。前两位表示错位类型（01｜02），中间两位表示业务模块（00-99），最后两位表示错误序号（00-99）
$lang['010000'] = "系统错误";

//users
$lang['020100'] = "参数userid为空";
$lang['020101'] = "userId为%s对应的用户不存在";
$lang['020102'] = "userid为%s对应的用户密码错误";
$lang['020103'] = "邮件为空";
$lang['020104'] = "手机号为空";
$lang['020105'] = "昵称为空";
$lang['020106'] = "邮件格式不正确";
$lang['020107'] = "邮件最长100个字母";
$lang['020108'] = "手机号必须为11位数字";
$lang['020109'] = "昵称最长100个字符";
$lang['020110'] = "密码为空";
$lang['020111'] = "该邮箱已被注册";
$lang['020112'] = "该手机已被注册";
$lang['020113'] = "登录邮箱或手机号为空";
$lang['020114'] = "登录密码错误";

$lang['020115'] = "姓名最长5个字符";
$lang['020116'] = "QQ号必须是6到14位的数字";
$lang['020117'] = "城市最长30个字符";
$lang['020118'] = "毕业院校最长50个字符";
$lang['020119'] = "专业最长30个字符";
$lang['020120'] = "职场状态最长50个字符";
$lang['020121'] = "期望咨询时间段最长50个字符";
$lang['020122'] = "请先注册，然后登录";
$lang['020123'] = "请先注册，然后登录";

//banners
$lang['020201'] = '参数width为空';
$lang['020202'] = '参数width必须为数字';

//feedback
$lang['020301'] = '参数content为空';
$lang['020302'] = '参数content最长1000个字';

//jobs
$lang['020401'] = '参数careflag为空';
$lang['020402'] = '参数code为空';
$lang['020403'] = "参数userid为空";

//mbtis
$lang['020501'] = '参数abbr为空';

//quizs
$lang['020601'] = '参数answers为空';
$lang['020602'] = '参数answers的格式为：“题号|选项;题号|选项;题号|选项;……”。例如：“0001｜A;0002｜B;0003｜C;……”';

//tutors
$lang['020701'] = '参数code为空';
$lang['020702'] = '参数tutorid为空';

